Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSetAttributes Constructor
Overload List
Name | Description
StraightDimensionSet.StraightDimensionSetAttributes() |  Obsolete.
 Creates a default straight dimension set attributes instance that loads standard attributes.
StraightDimensionSet.StraightDimensionSetAttributes(String) |  Obsolete.
 Creates a straight dimension set attributes instance that loads the specified attributes.
StraightDimensionSet.StraightDimensionSetAttributes(ModelObject)
 Creates a default straight dimension set attributes instance that loads standard attributes.
StraightDimensionSet.StraightDimensionSetAttributes(ModelObject, String)
 Creates a straight dimension set attributes instance that loads the specified attributes.
Top
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace